In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("carprices.csv")
df.head()

  Car Model  Mileage  Sell Price($)  Age(yrs)
0    BMW X5    69000          18000         6
1    BMW X5    35000          34000         3
2    BMW X5    57000          26100         5
3    BMW X5    22500          40000         2
4    BMW X5    46000          31500         4

In [4]:
df.tail()

                Car Model  Mileage  Sell Price($)  Age(yrs)
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [10]:
df.sample(n=3)

  Car Model  Mileage  Sell Price($)  Age(yrs)
4    BMW X5    46000          31500         4
2    BMW X5    57000          26100         5
8   Audi A5    91000          12000         8

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car Model      13 non-null     object
 1   Mileage        13 non-null     int64
 2   Sell Price($)  13 non-null     int64
 3   Age(yrs)       13 non-null     int64
dtypes: int64(3), object(1)
memory usage: 548.0+ bytes

In [15]:
df.dtypes

Car Model        object
Mileage           int64
Sell Price($)     int64
Age(yrs)          int64
dtype: object

In [19]:
df.shape

(13, 4)

In [24]:
df.size

52

In [27]:
df.ndim

2

In [29]:
df.describe()

            Mileage  Sell Price($)   Age(yrs)
count     13.000000      13.000000  13.000000
mean   60884.615385   26023.076923   5.307692
std    19185.665055    8003.661021   1.652504
min    22500.000000   12000.000000   2.000000
25%    52000.000000   20000.000000   5.000000
50%    59000.000000   26100.000000   5.000000
75%    72000.000000   32000.000000   6.000000
max    91000.000000   40000.000000   8.000000

In [35]:
df['Car Model'].unique()

array(['BMW X5', 'Audi A5', 'Mercedez Benz C class'], dtype=object)

In [38]:
df.nunique()

Car Model         3
Mileage          12
Sell Price($)    13
Age(yrs)          7
dtype: int64

In [39]:
df.isnull()

    Car Model  Mileage  Sell Price($)  Age(yrs)
0       False    False          False     False
1       False    False          False     False
2       False    False          False     False
3       False    False          False     False
4       False    False          False     False
5       False    False          False     False
6       False    False          False     False
7       False    False          False     False
8       False    False          False     False
9       False    False          False     False
10      False    False          False     False
11      False    False          False     False
12      False    False          False     False

In [40]:
df.isna()

    Car Model  Mileage  Sell Price($)  Age(yrs)
0       False    False          False     False
1       False    False          False     False
2       False    False          False     False
3       False    False          False     False
4       False    False          False     False
5       False    False          False     False
6       False    False          False     False
7       False    False          False     False
8       False    False          False     False
9       False    False          False     False
10      False    False          False     False
11      False    False          False     False
12      False    False          False     False

In [42]:
df.fillna(1)

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [51]:
df1 = df[['Mileage']]
df1
df1.clip(40000,70000)

    Mileage
0     69000
1     40000
2     57000
3     40000
4     46000
5     59000
6     52000
7     70000
8     70000
9     67000
10    70000
11    70000
12    59000

In [54]:
df.columns

Index(['Car Model', 'Mileage', 'Sell Price($)', 'Age(yrs)'], dtype='object')

In [57]:
df.sort_values(by=['Age(yrs)','Mileage'])

                Car Model  Mileage  Sell Price($)  Age(yrs)
3                  BMW X5    22500          40000         2
1                  BMW X5    35000          34000         3
4                  BMW X5    46000          31500         4
6                 Audi A5    52000          32000         5
2                  BMW X5    57000          26100         5
5                 Audi A5    59000          29400         5
12  Mercedez Benz C class    59000          33000         5
9   Mercedez Benz C class    67000          22000         6
0                  BMW X5    69000          18000         6
7                 Audi A5    72000          19300         6
11  Mercedez Benz C class    79000          21000         7
10  Mercedez Benz C class    83000          20000         7
8                 Audi A5    91000          12000         8

In [60]:
df.value_counts('Age(yrs)')

Age(yrs)
5    4
6    3
7    2
4    1
3    1
2    1
8    1
Name: count, dtype: int64

In [65]:
df.nlargest(n=4, columns='Mileage')

                Car Model  Mileage  Sell Price($)  Age(yrs)
8                 Audi A5    91000          12000         8
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
7                 Audi A5    72000          19300         6

In [68]:
df2 = df.copy()
df2

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [79]:
df.loc[0:2,['Mileage']]

   Mileage
0    69000
1    35000
2    57000

In [83]:
df.rename(columns={'Mileage':'Miles'})

                Car Model  Miles  Sell Price($)  Age(yrs)
0                  BMW X5  69000          18000         6
1                  BMW X5  35000          34000         3
2                  BMW X5  57000          26100         5
3                  BMW X5  22500          40000         2
4                  BMW X5  46000          31500         4
5                 Audi A5  59000          29400         5
6                 Audi A5  52000          32000         5
7                 Audi A5  72000          19300         6
8                 Audi A5  91000          12000         8
9   Mercedez Benz C class  67000          22000         6
10  Mercedez Benz C class  83000          20000         7
11  Mercedez Benz C class  79000          21000         7
12  Mercedez Benz C class  59000          33000         5

In [84]:
df.drop([0,1,2,3])

                Car Model  Mileage  Sell Price($)  Age(yrs)
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [98]:
df.groupby('Car Model').value_counts()

Car Model              Mileage  Sell Price($)  Age(yrs)
Audi A5                52000    32000          5           1
                       59000    29400          5           1
                       72000    19300          6           1
                       91000    12000          8           1
BMW X5                 22500    40000          2           1
                       35000    34000          3           1
                       46000    31500          4           1
                       57000    26100          5           1
                       69000    18000          6           1
Mercedez Benz C class  59000    33000          5           1
                       67000    22000          6           1
                       79000    21000          7           1
                       83000    20000          7           1
Name: count, dtype: int64

In [100]:
df.groupby('Car Model')['Car Model'].value_counts()

Car Model
Audi A5                  4
BMW X5                   5
Mercedez Benz C class    4
Name: count, dtype: int64